[
  {
    "path": "posts/2021-06-23-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "LANG Shuang Lesley",
        "url": "https://scis.smu.edu.sg/master-it-business"
      }
    ],
    "date": "2021-06-20",
    "categories": [],
    "contents": "\r\n1. The Original Visualization\r\nFor this DataViz Makeover assignment, data was downloaded from Department of Statistics, Singapore (DOS). The graph below shows Singapore’s 10 major merchandise trading partners.\r\n\r\n2. Critiques and suggestions for current visualisation\r\n2.1 Clarity\r\n1. No Graph Title\r\nThere’s no title to indicate the content of the original graph. As a viewer, it’s not clear to find out what is this graph about or what is the purpose and key points of showing this graph.\r\n2. Missing Proper Labels for Axes\r\nThere’s no title or unit labeled in the original graph for both x- and y- axes. Viewers can not tell the x- and y- axes represent the amount for Export and Import, whether it’s in Singapore dollar or in percentage. In addition, there’s no tick marks on both x- and y- axes. Viewers have to eye-ball to locate the import and export amount which is not accurate. Furthermore, viewers are not able to tell whether the scale of x- and y- axes are synchronized.\r\n3. Overlapping Shapes\r\nIn the original graph, the location of each bubble is determined by the Import and Export amount of the particular trading partner. And therefore indicates whether it’s a net importer or exporter by checking the bubble lies on the blue or green region in the graph. However, as the shapes are all in solid form and many are overlapping with each other, the center points of some bubbles are not shown but covered by others instead. Viewers can not tell the exact positions of the center points and thus they are neither able to see which region the bubbles fall in nor determine the corresponding country / region is net importer or exporter.\r\n4. Confusing Bubble Size\r\nThe size of each circle is determined by the sum of import and export amount of respective trading partner which is the sum of the values on x-axis and y-axis. This is not straight forward for hte audience to understand.\r\n5. Unclear Top Net Importer / Exporter\r\nIt’s not clear how Top Net Importer (Taiwan) and Top Net Exporter (Hong Kong) are determined. Viewers are not sure the calculation is based on the difference of import and export amount or the percentage of import / export volume compared with the total amount.\r\n6. Missing Legends\r\nThere’s no legends shown in the original graph to tell the viewers what are the colors used to represent different counties / regions respectively. Also, the background colors of import and export are not explained. The usage of top net importer and exporter icons are placed way below the graph which is not helpful for viewer to understand.\r\n7. Unable to Show Changes in Trade Over Time\r\nThe original graph failed to indicate the changes of Singapore’s 10 major merchandise trading partners over the years. Instead, it shows the import and export trades with these partners in 2020 only.\r\n2.2 Aesthetic\r\n1. Poor Color Choice\r\nThe colors chosen for the bubbles in the orginal graph are not contrast with each other sufficiently. Using blue and green to differentiate import and export are not sufficiently significant as the background of the webpage is also in light blue. To make the graph more viewer-friendly and easy to understand, both colors should be avoided.\r\n2. Poor Transparency\r\nSolid circles should be avoided to prevent overlapping bubbles. The transparency of the shapes should be adjusted in order for viewers to see the center points of each bubble and therefore be able determine the position.\r\n3. Misleading Labels\r\nThe purpose of displaying the labels of each trading partner next to the corresponding bubble is to indicate the net trading amount and the particular country / region name. However, some labels are not aligned with the bubbles but away from them. Viewers may mistakenly read the numbers and names wrongly. Moreover, some labels are lying on the bubbles of other countries / regions and covering their center points. This makes the graph difficult to read. Using tooltip will be more suitable for this case to avoid making the graph too crowded and to highlight additional key information.\r\n3. Alternative Design\r\nThe proposed design is shown as below :\r\n\r\n3.1 Clarity\r\nTitle is given to illustrate the purpose of showing this graph.\r\nAxes labels and unit labels as well as tick marks are provided to help viewer understand the figures indicated in the graph.\r\nThe use of contrast colors for the circles and reference line on a clear background can help the viewer identify the differences.\r\nInstead of showing 2020 trading amount only, a range from 2011 to 2020 are provided for viewers to better understand the changes over the years upon their selection. tradn\r\nCountry / region with the minimum (ranked 10th in net trading balance among the 10 partners) and maximum (ranked 1st) trading balances are labeled to highlight to the viewers as top importer and top exporter. `\r\n3.2 Aesthetic\r\nRemoved additional icons and wordings but use tooltip to highlight the key information when mouse over to avoid the messiness.\r\nWhite border and 80% opacity are applied to avoid overlapping issue.\r\nSimple colors “red” and “blue” are used to indicate the trading balances to improve the tidiness of the graph.\r\n4. Proposed Visualisation\r\nThe interactive visualization can be found on Tableau Public.\r\n5. Step-By-Step Guide\r\n5.1 Data Preparation\r\nStep 1\r\nRemove the content sheet and only keep the data from Jan 2011 to Dec 2020 for the 10 trading partners : EU, Hong Kong, Indonesia, Japan, Mainland China, Malaysia, Republic of Korea, Taiwan, Thailand and United States. \r\nStep 2\r\nThe unit for EU is in million dollars whereas the rests are in thousand dollars. To standardize the unit and make it comparable, use million dollars as the only unit by dividing 1000 for the rest of 9 trading partners and only keep 2 decimals then save the cleaned spreadsheet.\r\n\r\n\r\nStep 3\r\nOpen the spreadsheet in Tableau and drag “Imports” in the main pane. Select the second column (2011 Jan), press “Shift” button on the keyboard. Then move to the last column (2020 Dec) and select it. Right-click on the mouse and select “Pivot” from the list. Two new Pivot Fields columns are formed representing the month year and trading amount. Rename them to “Time” and “Import Amount”.\r\n\r\nStep 4\r\nSelect the first column “Variables”, right-click on the mouse and select “Split”. A new column is formed with the partners’ names only.\r\n\r\nRename the new column to “Trading Partners” and hide the original one.\r\n\r\nStep 5\r\nSet the “Time” and “Import Amount” columns into “Date” and “Number(Decimal)” formats respectively. Copy the 3 columns into a new Excel spreadsheet.\r\n\r\nStep 6\r\nRepeat Step 3 to Step 5 for “Exports”. Copy the 3 columns into the same Excel spreadsheet with Import data. Remove repeated columns and only keep “Trading Partners”, “Time” and “Import Amount” & “Export Amount”.\r\n\r\nStep 7\r\nOpen the spreadsheet containing the new dataset in Tableau and make sure all data formats are correct then enter the working Sheet.\r\n\r\nStep 8\r\nDrag ‘Export Amount’ to “Columns” and ‘Import Amount’ to “Rows”.\r\n\r\nStep 9\r\nGo to “Analysis” on the top menu bar and select “Create Calculated Field”.\r\n\r\nCreate “Total Trading Amount” by adding “Import Amount” and “Export Amount” together.\r\n\r\nCreate “Net Trading Balance” by using “Export Amount” to minus “Import Amount”.\r\n\r\nStep 10\r\nIn the “Marks” pane, drag “Total Trade Amount” into “Size”, “Net Trading Balance” into “Color” and “Trading Partners” into “Detail”. Select “Circle” from “Shape” and adjust the “Size” of the circles.\r\n\r\nUnder “Color” settings, change “Opacity” to 80% and “Border” to white color to avoid occlusion and make sure viewers are able to identify the borders.\r\nStep 11\r\nSelect “Edit Colors” option upon clicking “Net Trading Balance” dropdown list.\r\n\r\nSelect “Red-Blue Diverging” from the “Palette” dropdown list and select “Use Full Color Range” checkbox to ensure the color contrasts. Click on the “Advanced” button and select “Center” and set as “0”.\r\n\r\nTherefore, if the Net Export amount is positive, the circle will be shown in blue color. Otherwise, the circle will be shown in red, which means the import amount is larger than export.\r\nStep 12\r\nDrag “Trading Partners” and “Net Trading Balance” to “Label” under Mart Pane. Click on “Label” to edit “Alignment”. Select “Center” for “Horizontal” and “Middle” for “Vertical”. Select “Min/Max” for “Marks to Label” and select “Sum(Net Trading Balance)” from “Field” dropdown list. Tick the checkbox for “Label minimum value” and Label maximum value\".\r\n\r\nStep 13\r\nDrag “Time” to “Filters” pane and select “Years” as to be the parameter to be filtered on.\r\n\r\nSelect “All” the years in the list and click on “OK”.\r\n\r\nSelect “Show Filter” from the dropdown list so that “Years” is shown on the right-hand-side as the filter.\r\n\r\nSelect “Single Value (list)” from the dropdown list of Year(Time) filter and untick “Show”All\" Value\".\r\n\r\nStep 14\r\nGo to “Analysis” “Create Calculated Field” to create a new parameter “Reference Line”.\r\n\r\nDrag it to the “Rows” and make it a second axis. Right-click and select “Synchronize Axis”\r\n\r\nRight-click on the graph and select “Trend Lines” and choose“Show Trend Lines” and tick “SUM(Reference Line)”.\r\n\r\nRight-click on the trending line and select “Format” and choose the dotted line.\r\n\r\nIn the Mark Pane of “SUM(Reference Line)”, remove tooltip and labels and choose “Opacity” as “0”.\r\n\r\nGo to y-axis and uncheck “Show Header”.\r\n\r\nStep 15\r\nCreate two new parameters, “Net Import” and “Net Export” for the tooltip display.\r\n\r\nCreate a new calculation field “Net Trade Ranking”.\r\n\r\nLeft-click Tooltip in “Mark Pane”, update the Tooltip fields to show trade deficit in red and surplus in blue. Add “Net Trade Ranking” to tooltip as well, select “Trading Partners” as “Compute Using”.\r\n\r\nStep 16\r\nArrange the wordings and edit in the Tooltip textbox :\r\n\r\nStep 17\r\nAdd a graph title and select to insert “YEAR(Time)” :\r\n\r\nStep 18\r\nMove the YEAR(Time) filter above the graph and hide other legends.\r\n\r\nThe completed graph looks like below :\r\n\r\n6. Observations\r\nEU\r\nEU has always been a net importer to Singapore over the past 10 years. However, the import and export volume are getting closer and the overall trade balance are becoming more neutral.\r\nHong Kong\r\nHong Kong has always been the top exporter a.k.a. ranked number 1 in the net trading balace of Singapore over the past 10 years. The floating range of net trading balance is quite stable which is within the range of 51k to 61k (million dollars). Over the years it maintains a growing trend gradually over the years except for 2019 which might caused by the social instability in Hong Kong.\r\nJapan & Republic of Korea\r\nAccording to the graph, Singapore’s net merchandise trading with these 2 countries are moving from trade deficit (2011 - 2016) towards trade balance (2016 - 2020). This might be due to the stable trading policies and economic stability.\r\nare quite balanced with these 2 partners as they all located near the diagonal reference line.\r\nIndonesia\r\nTh net trading volume between Indonesia and Singapore has shrinked significantly in the past decade. The export to Indonesia has dropped from 57 in 2011 to 30 in 2020 (in billion dollars). In addition, the import from Indonesia to Singapore also decreased since 2015. As the fourth most populous nation, Indonesia’s economy has been growing rapidly in recent years. The observations in merchandise trade between Singapore and Indonesia indicates that Indonesia is becoming more self-sufficient and depend less on foreign import.\r\nMainland China & Malaysia\r\nBefore 2013, Malaysia was Singapore’s largest trading partner in terms of total trading amount. However, mainland China has taken over Malaysia and became the country with biggest trading volume with Singapore since 2013. The overall import and export amount of these two countries each account for about 10% of the overall trading volume in th epast decade. There’s no doubt that these two countries are the most important trading partners of Singapore.\r\nTaiwan\r\nTaiwan has always been a net importer to Singapore and became the largest importer to Singapore since 2018 though the export amount kept increasing over the years.\r\nThailand\r\nMerchandise trading between Singapore and Thailand has been quite stable over the years. Thailand as Singapore’s smallest trading partner among the top 10 is always a net exporter to Singapore.\r\nUnited States\r\nUnited States used to be the top importer to Singapore before 2018. However, due to arising of the export amount to United States, the net trading balance between Singapore and United States has moved towards neutral since 2016 and become trade surplus in 2020.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-27T06:19:35+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-06-07-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "DataViz Makeover 1 for ISSS608: Visual Analytics",
    "author": [
      {
        "name": "LANG Shuang Lesley",
        "url": "https://scis.smu.edu.sg/master-it-business"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\n1.0 The Original Visualization\r\nThe original visualisation can be seen below :\r\n\r\n2.1 Clarity\r\n1. Inaccurate graph title\r\nFor Hong Kong, Mainland China, Malaysia, Taiwan and US, the graphs have indicated the Import and Export data from 2019 to 2021. Whereas for Japan, the graph only covers trades from 2019 and 2020. Therefore, using the title “2019-2020” is not accurate.\r\n2. Inconsistent y-axis ranges\r\nThe y-axis on the left and on the right represent Export and Import data respectively. However, the scale of these two axes are not synchronized. As a result, the graphs showing can not be used for comparison. In addition, the scale of y-axis of each country is consistent which make it impossible to conduct comparison among these countries.\r\n3. Incorrect dataset selected\r\nBy checking the data source, the selected countries are not the top 6 countries in term of trading amounts, e.g. Indonesia has higher export amount than Taiwan and Japan.\r\n4. Improper type of chart\r\nArea charts were chosen in this visualization. However, it’s not the best choice of chart type to show the development of trading volumes over time as area chart works best for displaying multiple values over a period of time for considerably large differences between the values. The overlapping areas make it hard to see the moving trends of the tradeing values.\r\n5. Lack of clear labeling\r\nThere’s no labeling of y-axis unit in all 6 graphs.\r\n2.2 Aesthetic\r\n1. Selection of colors\r\nThe two colors selected do not show the contrast clearly\r\n2. Multiple graphs\r\nUsing individual graph for each country does not really point out the difference in the trade volumes directly.\r\n3. Legend\r\nThe legends are not well-defined in the graph.\r\n4. Data source\r\nThere’s no mention of data source in this graph.\r\n3.0 Proposed Visualisation\r\n\r\n4.0 Step-by-step Guide\r\n4.1 Data Preparation\r\nStep 1 Delete unecessary data and only keep the 2019 and 2020 data belong to the 6 countries for both Import and Export :\r\n\r\nStep 2 Import data to Tableau :\r\n\r\nStep 3 Select the data and set up the graph. Change the title, include the filter and add the legend and reference line :\r\n\r\nStep 4 Create the Net Trade formula and add it to the graph :\r\n\r\n5.0 Observations\r\n5.1 Hong Kong\r\nHong Kong is Singapore’s biggest export country among the six.\r\n5.2 Japan\r\nThere’s not much variation in term of the trading amount between Singapore and Japan in the past 2 years.\r\n5.3 Mainland China\r\nMainland China has the most trading volume with Singapore in both Import and Export.\r\n5.4 Malaysia\r\nThe net trade between Singapore and Malaysia dropped significantly in 2020. Mostly due to the impact of Covid-19.\r\n5.5 United States\r\nTrades between Singapore and United States is switching from deficit to surplus overall (Export > Import).\r\n5.6 Taiwan\r\nTaiwan has the greatest trade deficits (Export < Import) with Singapore. It is also the smallest trading partner among the six countries.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-07T09:02:25+08:00",
    "input_file": {}
  }
]
