[
  {
    "path": "posts/2021-06-07-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "DataViz Makeover 1 for ISSS608: Visual Analytics",
    "author": [
      {
        "name": "LANG Shuang Lesley",
        "url": "https://scis.smu.edu.sg/master-it-business"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\n1.0 The Original Visualization\r\nThe original visualisation can be seen below :\r\n\r\n2.1 Clarity\r\n1. Inaccurate graph title\r\nFor Hong Kong, Mainland China, Malaysia, Taiwan and US, the graphs have indicated the Import and Export data from 2019 to 2021. Whereas for Japan, the graph only covers trades from 2019 and 2020. Therefore, using the title “2019-2020” is not accurate.\r\n2. Inconsistent y-axis ranges\r\nThe y-axis on the left and on the right represent Export and Import data respectively. However, the scale of these two axes are not synchronized. As a result, the graphs showing can not be used for comparison. In addition, the scale of y-axis of each country is consistent which make it impossible to conduct comparison among these countries.\r\n3. Incorrect dataset selected\r\nBy checking the data source, the selected countries are not the top 6 countries in term of trading amounts, e.g. Indonesia has higher export amount than Taiwan and Japan.\r\n4. Improper type of chart\r\nArea charts were chosen in this visualization. However, it’s not the best choice of chart type to show the development of trading volumes over time as area chart works best for displaying multiple values over a period of time for considerably large differences between the values. The overlapping areas make it hard to see the moving trends of the tradeing values.\r\n5. Lack of clear labeling\r\nThere’s no labeling of y-axis unit in all 6 graphs.\r\n2.2 Aesthetic\r\n1. Selection of colors\r\nThe two colors selected do not show the contrast clearly\r\n2. Multiple graphs\r\nUsing individual graph for each country does not really point out the difference in the trade volumes directly.\r\n3. Legend\r\nThe legends are not well-defined in the graph.\r\n4. Data source\r\nThere’s no mention of data source in this graph.\r\n3.0 Proposed Visualisation\r\n\r\n4.0 Step-by-step Guide\r\n4.1 Data Preparation\r\nStep 1 Delete unecessary data and only keep the 2019 and 2020 data belong to the 6 countries for both Import and Export :\r\n\r\nStep 2 Import data to Tableau :\r\n\r\nStep 3 Select the data and set up the graph. Change the title, include the filter and add the legend and reference line :\r\n\r\nStep 4 Create the Net Trade formula and add it to the graph :\r\n\r\n5.0 Observations\r\n5.1 Hong Kong\r\nHong Kong is Singapore’s biggest export country among the six.\r\n5.2 Japan\r\nThere’s not much variation in term of the trading amount between Singapore and Japan in the past 2 years.\r\n5.3 Mainland China\r\nMainland China has the most trading volume with Singapore in both Import and Export.\r\n5.4 Malaysia\r\nThe net trade between Singapore and Malaysia dropped significantly in 2020. Mostly due to the impact of Covid-19.\r\n5.5 United States\r\nTrades between Singapore and United States is switching from deficit to surplus overall (Export > Import).\r\n5.6 Taiwan\r\nTaiwan has the greatest trade deficits (Export < Import) with Singapore. It is also the smallest trading partner among the six countries.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-07T09:02:24+08:00",
    "input_file": "dataviz-makeover-1.utf8.md"
  }
]
